<?php
header('Content-type:text/html;charset=utf-8');
//Task 1

echo "<h2>Домашно зад. 1 </h2>";
echo "<h3>Напишете програма, която проверява по зададени три ъгъла, дали с
тях може да се построи триъгълник.</h3>";

$a = 60;
$b = 60;
$c = 60;

echo "<p> a= ". $a ." ,b=".$b." and c=".$c."</p>";

if ($a+$b+$c==180) {
	echo "Може да се построи триъгълник.";
} else {
	echo "Не може да се построи триъгълник.";
}
//Task 2

echo "<h2>Домашно зад. 2 </h2>";
echo "<h3>Напишете програма, която проверява дали със зададените три
дължини на страни може да се построи триъгълник.
</h3>";

$a = rand(0,100);
$b = rand(0,100);
$c = rand(0,100);

echo "<p> a= ". $a ." ,b=".$b." and c=".$c."</p>";

if (($a+$b)<$c) {
	echo "Не може да се построи триъгълник";
	
if (($a+$c)<$b) {
	echo "Не може да се построи триъгълник";
	
if (($c+$b)<$a) {
	echo "Не може да се построи триъгълник";
	}}}
else{
	echo "Може да се построи триъгълник";
}
//Task 3

echo "<h2>Домашно зад. 3 </h2>";
echo "<h3>Проверете дали дадено число се дели на 3, 5 и 7 едновременно или
само на някое от тях.
</h3>";

$a=rand(0,9999);
echo "<p>a= ".$a."</p>";


if ($a%3==0 && $a%5==0 && $a%7==0) {
	echo "Числото се дели на 3, 5 и 7";
}elseif($a%3==0 && $a%5!=0 && $a%7!=0){
	echo "Числото се дели на 3";
}elseif ($a%3!=0 && $a%5==0 && $a%7!=0) {
	echo "Числото се дели на 5";
}elseif ($a%3!=0 && $a%5!=0 && $a%7==0) {
	echo "Числото се дели на 7";
}elseif ($a%3==0 && $a%5==0 && $a%7!=0) {
	echo "Числото се дели на 3 и 5";
}elseif ($a%3==0 && $a%5!=0 && $a%7==0) {
	echo "Числото се дели на 3 и 7";
}elseif ($a%3!=0 && $a%5==0 && $a%7==0) {
	echo "Числото се дели на 5 и 7";
}
else{
	echo "Числото не се дели на 3,5 и 7";
}

//Task 4

echo "<h2>Домашно зад. 4 </h2>";
echo "<h3>Напишете програма, която по зададени единици използвана
електроенергия и тяхната цена изчислява сметката за ток, при следните условия.
- За първите 50 единици - 0,10 лв/единица
- За следващите 100 - 0,15 лв./единица
- За следващите 100 - 0,25 лв./единица
- За следващите - 0,35 лв/единица.
- Към общата сметка се добавят 20% ДДС.

</h3>";

$a=(0.10);
$b=(0.15);
$c=(0.25);
$d=(0.35);
$bill1=(50*$a);
$bill2=($bill1+(100*$b));
$bill3=($bill2+(100*$c));
$bill4=($bill3+(100*$d));
$price=rand(1,1000);
$final;



echo "<p>".$price."</p>";

if ($price<=50) {
    $final=(($price*$a)*1.2);
	echo "Вашата дължима сумa е:".$final ;
} elseif ($price>50 && $price<=150) {
	$final=(($bill1+(($price-50)*$b))*1.2);
	echo "Вашата дължима сумa е:".$final ;
} elseif ($price>150 && $price<=250) {
    $final=(($bill2+(($price-150)*$c))*1.2);
	echo "Вашата дължима сумa е:".$final ;
} elseif ($price>250) {
	$final=(($bill3+(($price-250)*$c))*1.2);
	echo "Вашата дължима сумa е:".$final ;
} else {
	echo "<p>Вашата дължима сумa е".$final."</p> ";
}

//Task 5

echo "<h2>Домашно зад. 5 </h2>";
echo "<h3>Напишете програма, която проверява дали зададената
комбинация от ден /от 1-31/, месец, година е валидна дата</h3>";

$d=rand(1,100);
$m=rand(1,20);
$y=rand(1,5000);

echo "ден: ".$d;
echo "месец: ".$m;
echo "година: ".$y;

if(($d>=1 && $d<=31) && ($m>=1 && $m<=12) && ($y==1 && $y<=2015)){
	echo "датата е валидна и отминала :)";
}else {
	echo "<p>датата e в бъдещето</p>";
}

//Task 6

echo "<h2>Домашно зад. 6 </h2>";
echo "<h3>Да се напише програма, която подрежда 5 числа в нарастващ ред</h3>";

$a = array(
	rand(0, 100),
	rand(0, 100), 
	rand(0, 100),
	rand(0, 100),
	rand(0, 100) );
sort($a);
$length=count($a);

for ($i=0; $i < $length; $i++) { 
	echo $a[$i];
	echo'<br>';
}
